<a href="https://colab.research.google.com/github/UznetDev/Data-science-home-work/blob/main/24_Avg_2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL**

### Import librares

In [20]:
import pandas as pd

### Set-up for SQL

In [21]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

##### Load dataset

In [22]:
monarchs = pd.read_csv('monarchs.csv')
presidents = pd.read_csv('presidents.csv')
prime_minister_terms = pd.read_csv('prime_minister_terms.csv')
prime_ministers = pd.read_csv('prime_ministers.csv')
states = pd.read_csv('states.csv')

##### Upload dataset to SQL

In [23]:
%sql DROP TABLE IF EXISTS monarchs;
%sql --persist monarchs

%sql DROP TABLE IF EXISTS presidents;
%sql --persist presidents

%sql DROP TABLE IF EXISTS prime_minister_terms;
%sql --persist prime_minister_terms

%sql DROP TABLE IF EXISTS prime_ministers;
%sql --persist prime_ministers

%sql DROP TABLE IF EXISTS states;
%sql --persist states

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted states'

### Class work

#### Part 1

In [25]:
%%sql
SELECT continent, COUNT(country) AS number_of_countries
FROM states
GROUP BY continent
ORDER BY number_of_countries DESC

 * sqlite://
Done.

[('Asia', 4),
 ('South America', 2),
 ('Europe', 2),
 ('Oceania', 1),
 ('North America', 1),
 ('Africa', 1)]

In [27]:
%%sql SELECT AVG(indep_year)
FROM states;

 * sqlite://
Done.

[(1829.0,)]

In [28]:
%%sql SELECT AVG(indep_year)
FROM states
WHERE indep_year > 200;

 * sqlite://
Done.

[(1829.0,)]

In [31]:
%%sql SELECT continent, COUNT(prime_minister) AS number_of_prime_ministers
FROM prime_ministers
GROUP BY continent
ORDER BY number_of_prime_ministers DESC;

 * sqlite://
Done.

[('Asia', 4), ('Europe', 3), ('Oceania', 2), ('Africa', 1)]

In [32]:
%%sql SELECT continent, COUNT(prime_minister) AS number_of_prime_ministers
FROM prime_ministers
GROUP BY continent
HAVING number_of_prime_ministers > 10
ORDER BY number_of_prime_ministers DESC;

 * sqlite://
Done.

[]

In [34]:
%%sql SELECT prime_minister, pm_start
FROM prime_minister_terms
ORDER BY pm_start DESC
LIMIT 1;

 * sqlite://
Done.

[('Shehbaz Sharif', 2022)]

In [36]:
%%sql SELECT prime_minister, MAX(pm_start)
FROM prime_minister_terms;

 * sqlite://
Done.

[('Shehbaz Sharif', 2022)]

In [37]:
%%sql SELECT continent, COUNT(*) AS number_of_states
FROM monarchs
GROUP BY continent
ORDER BY number_of_states;

 * sqlite://
Done.

[('Asia', 2), ('Europe', 2)]

In [38]:
%%sql SELECT continent,
      (SELECT COUNT(*)
       FROM monarchs
       WHERE monarchs.continent = states.continent) AS number_of_states
FROM states
GROUP BY continent
ORDER BY number_of_states;

 * sqlite://
Done.

[('Africa', 0),
 ('North America', 0),
 ('Oceania', 0),
 ('South America', 0),
 ('Asia', 2),
 ('Europe', 2)]

In [40]:
%%sql SELECT continent,
      (SELECT COUNT(*)
       FROM monarchs
       WHERE monarchs.continent = states.continent) AS number_of_states
FROM states
GROUP BY continent
ORDER BY number_of_states DESC;

 * sqlite://
Done.

[('Europe', 2),
 ('Asia', 2),
 ('South America', 0),
 ('Oceania', 0),
 ('North America', 0),
 ('Africa', 0)]

In [43]:
%%sql SELECT prime_minister, MAX(pm_start) AS last_term
FROM prime_minister_terms
GROUP BY prime_minister
HAVING last_term > 2000;

 * sqlite://
Done.

[('António Costa', 2015),
 ('Boris Johnson', 2019),
 ('Haitham bin Tarik', 2020),
 ('Jacinda Ardern', 2017),
 ('Jonas Gahr Støre', 2021),
 ('Mostafa Madbouly', 2018),
 ('Narendra Modi', 2014),
 ('Scott Morrison', 2018),
 ('Shehbaz Sharif', 2022)]

In [44]:
%%sql SELECT prime_minister, MAX(pm_start) AS last_term
FROM prime_minister_terms
GROUP BY prime_minister;

 * sqlite://
Done.

[('António Costa', 2015),
 ('Boris Johnson', 2019),
 ('Haitham bin Tarik', 2020),
 ('Hassanal Bolkiah', 1984),
 ('Jacinda Ardern', 2017),
 ('Jonas Gahr Støre', 2021),
 ('Mostafa Madbouly', 2018),
 ('Narendra Modi', 2014),
 ('Scott Morrison', 2018),
 ('Shehbaz Sharif', 2022)]

In [45]:
%%sql SELECT prime_minister, MAX(pm_start) AS last_term
FROM prime_minister_terms
GROUP BY prime_minister
HAVING pm_start > 2000;

 * sqlite://
Done.

[('António Costa', 2015),
 ('Boris Johnson', 2019),
 ('Haitham bin Tarik', 2020),
 ('Jacinda Ardern', 2017),
 ('Jonas Gahr Støre', 2021),
 ('Mostafa Madbouly', 2018),
 ('Narendra Modi', 2014),
 ('Scott Morrison', 2018),
 ('Shehbaz Sharif', 2022)]

In [48]:
%%sql SELECT continent, COUNT(country) AS number_of_states
FROM prime_ministers
WHERE country LIKE '%a%'
GROUP BY continent;

 * sqlite://
Done.

[('Asia', 3), ('Europe', 2), ('Oceania', 2)]